; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph0 - mode
	thermograph3 - mode
	infrared2 - mode
	spectrograph1 - mode
	image4 - mode
	Star5 - direction
	Star2 - direction
	GroundStation1 - direction
	Star3 - direction
	Star0 - direction
	Star4 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph3)
	(supports instrument0 image4)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument4 image4)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image4)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 Star4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite3 Star3)
	(have_image Planet6 image4)
	(have_image Planet7 infrared2)
	(have_image Phenomenon8 thermograph0)
	(have_image Star9 thermograph3)
	(have_image Star10 thermograph3)
	(have_image Star11 thermograph3)
	(have_image Planet12 spectrograph1)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 thermograph3)
))

)

; plan
1. (turn_to satellite2 star2 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star2)
   goals met: 0 of 10
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite2 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite2 phenomenon8 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon8)
   goals met: 0 of 10
5. (take_image satellite2 phenomenon8 instrument3 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 1 of 10
6. (turn_to satellite2 phenomenon14 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 10
7. (turn_to satellite1 star3 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star3)
   goals met: 1 of 10
8. (turn_to satellite0 star4 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star4)
   goals met: 1 of 10
9. (take_image satellite2 phenomenon14 instrument3 thermograph3)
   added: (have_image phenomenon14 thermograph3)
   goals met: 2 of 10
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 10
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 10
12. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 2 of 10
13. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 10
14. (turn_to satellite0 phenomenon13 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 10
15. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 10
16. (turn_to satellite0 planet12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet12)
   goals met: 3 of 10
17. (take_image satellite0 planet12 instrument0 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 4 of 10
18. (turn_to satellite0 planet6 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet6)
   goals met: 4 of 10
19. (take_image satellite0 planet6 instrument0 image4)
   added: (have_image planet6 image4)
   goals met: 5 of 10
20. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 5 of 10
21. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 6 of 10
22. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 6 of 10
23. (take_image satellite0 star11 instrument0 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 7 of 10
24. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 7 of 10
25. (take_image satellite0 star9 instrument0 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 8 of 10
26. (turn_to satellite1 planet7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet7)
   goals met: 8 of 10
27. (take_image satellite1 planet7 instrument2 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 9 of 10
28. (turn_to satellite3 star3 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 star3)
   goals met: 10 of 10
